simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/* ── Callback PSoC — batch recibido ─────────────────────────────────────── */

static void onBatch(const PsocBatch &batch)
{
    if (g_state != SAMPLING) return;
    pulseSampleCount(batch.n_samples);

    /* "Ver": disparo único en vivo. Tiene prioridad sobre el store para no
       depender del orden de llegada de SET_RECLEN vs CMD_VIEW. */
    if (g_view_remaining > 0) {
        transport.sendBatch(batch, g_t_start_us, NODE_ID);
        LOGM("BATCH", "seq=%u,view=1", batch.seq);
        if (--g_view_remaining == 0) {
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);   /* baja el flanco → para */
            g_state = STOPPED;
            SLAVE_LOG_PRINTF("[SLAVE] VIEW done\n");
            LOGM("VIEWDONE", "");
        }
        return;
    }

    /* Routing normal: si g_store_buf está allocado → acumula; si no → en vivo. */
    if (g_store_buf && g_store_fill < g_rec_n_batches) {
        /* Store-and-forward: acumular en RAM, sin RF */
        SampleBytes *dst = &g_store_buf[(size_t)g_store_fill * SPI_BATCH_SAMPLES];
        for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
            const PsocSample &s = batch.samples[i];
            dst[i].raw_lo = (uint8_t)( s.raw_input         & 0xFF);
            dst[i].raw_hi = (uint8_t)((s.raw_input  >> 8)  & 0xFF);
            dst[i].alog0  = (uint8_t)( s.post_analog        & 0xFF);
            dst[i].alog1  = (uint8_t)((s.post_analog >>  8) & 0xFF);
            dst[i].alog2  = (uint8_t)((s.post_analog >> 16) & 0xFF);
            dst[i].digi0  = (uint8_t)( s.post_digital        & 0xFF);
            dst[i].digi1  = (uint8_t)((s.post_digital >>  8) & 0xFF);
            dst[i].digi2  = (uint8_t)((s.post_digital >> 16) & 0xFF);
            dst[i].gain   = s.gain_byte;
            dst[i].flags  = s.sample_flags;
        }
        g_store_ts_us[g_store_fill] = (uint32_t)batch.timestamp_us;
        g_store_fill++;
        if (g_store_fill >= g_rec_n_batches) {
            g_state = STOPPED;
            digitalWrite(SYNC_TO_PSOC_PIN, LOW);
            SLAVE_LOG_PRINTF("[SLAVE] FULL -> STOPPED (%u batches)\n", g_store_fill);
        }
    } else if (!g_store_buf) {
        /* Sin store: enviar en tiempo real (streaming clásico) */
        transport.sendBatch(batch, g_t_start_us, NODE_ID);
        LOGM("BATCH", "seq=%u,live=1", batch.seq);
    }
}

/* ── Setup ───────────────────────────────────────────────────────────────── */

void setup()
{
    dbgLogBegin(115200);   /* Serial USB del esclavo = canal de log (humano+máquina) */
    SLAVE_LOG_PRINTF("[SLAVE %d] boot\n", NODE_ID);
    samplePulseBegin();
    debugEspHardwareBegin();
    SLAVE_LOG_PRINTF("[SCOPE] sample pulse pin=%d idle=%d us=%d\n",
                     SAMPLE_PULSE_PIN, SAMPLE_PULSE_IDLE, SAMPLE_PULSE_US);
    SLAVE_LOG_PRINTF("[SCOPE] debugHardware=%d start pin=%d idle=%d us=%d\n",
                     DEBUG_HARDWARE, DEBUG_HW_START_PIN,
                     DEBUG_HW_START_IDLE, DEBUG_HW_START_US);

#if defined(ESP8266)
    /* Modo AP oculto en canal 1: evita el background scanning que hace el
     * ESP8266 en modo STA desconectado (recorre ch1-13 buscando APs y pierde
     * paquetes ESP-NOW del canal 1 a distancia real). */
    WiFi.mode(WIFI_AP);
    WiFi.softAP("GeoSlave", "", 1, 1);   /* ssid, pass vacío, canal 1, oculto */
    delay(100);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d (AP-fixed)\n",
                     WiFi.macAddress().c_str(), wifi_get_channel());
#else
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    delay(100);
    SLAVE_LOG_PRINTF("[SLAVE] MAC: %s  ch=%d\n",
                     WiFi.macAddress().c_str(), WiFi.channel());
#endif

    /* ESP-NOW */
    if (!transport.begin(MASTER_MAC)) {
        SLAVE_LOG_PRINTLN("[SLAVE] ESP-NOW FAIL - halt");
        while (true) { delay(1000); }
    }
    esp_now_register_recv_cb(onDataRecv);

    /* GPIO hardware sync — pull-down para evitar ISR espurias cuando no hay cable */
    pinMode(SYNC_IN_PIN,      INPUT_PULLDOWN);
    pinMode(SYNC_TO_PSOC_PIN, OUTPUT);
    digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    attachInterrupt(digitalPinToInterrupt(SYNC_IN_PIN), onSyncEdge, CHANGE);

    /* UART → PSoC */
    psoc.begin(onBatch);

    SLAVE_LOG_PRINTF("[SLAVE %d] listo, esperando ARM\n", NODE_ID);
    LOGM("BOOT", "node=%d", NODE_ID);
}

/* ── Loop ────────────────────────────────────────────────────────────────── */

void loop()
{
    debugEspHardwareService();

    /* "Ver": levantar el flanco hacia el PSoC tras el pequeño retardo de arme. */
    if (g_view_armPending &&
        (int32_t)((uint32_t)micros() - g_view_armDueUs) >= 0) {
        g_view_armPending = false;
        g_t_start_us = (uint64_t)micros();
        debugEspHardwareStartPulse();
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);   /* flanco de subida → arranca */
        g_state = SAMPLING;
        SLAVE_LOG_PRINTF("[SLAVE] VIEW flanco arriba\n");
    }

    /* Drenar siempre la UART del PSoC (onBatch ignora si no está SAMPLING). */
    if (g_state == SAMPLING && g_debug_mode) {
        /* debug ESP: generar batch falso a 29412 µs (30 muestras @ 1020 Hz) */
        uint32_t nowUs = (uint32_t)micros();
        if ((uint32_t)(nowUs - g_debug_last_us) >= 29412) {
            g_debug_last_us += 29412;
            PsocBatch fake = {};
            fake.seq         = (uint16_t)(g_debug_count / SPI_BATCH_SAMPLES);
            fake.n_samples   = SPI_BATCH_SAMPLES;
            fake.timestamp_us= (uint64_t)micros() - g_t_start_us;
            for (int i = 0; i < SPI_BATCH_SAMPLES; i++) {
                fake.samples[i].post_digital = (int32_t)(g_debug_count & 0xFFFFFF);
                fake.samples[i].gain_byte = g_pga_code;
                fake.samples[i].sample_flags = 0;
                g_debug_count++;
            }
            onBatch(fake);
        }
    } else {
        psoc.poll();
    }

    /* Volver a esperar ARM después de STOP.
     * En modo store-and-forward (g_rec_n_batches > 0) permanecemos en STOPPED
     * respondiendo CMD_REQ_BATCH hasta que el maestro haya pedido todos los batches.
     * El maestro no envía ningún mensaje de "fin" — el slave sencillamente vuelve
     * a WAIT_ARM cuando recibe un CMD_ARM nuevo. */
    if (g_state == STOPPED && g_rec_n_batches == 0) {
        g_state = WAIT_ARM;
        SLAVE_LOG_PRINTF("[SLAVE %d] volviendo a WAIT_ARM\n", NODE_ID);
    }

    /* HELLO beacon cada 2 s en WAIT_ARM — diagnóstico de ESP-NOW bidireccional */
    static uint32_t lastHelloMs = 0;
    if (g_state == WAIT_ARM && millis() - lastHelloMs >= 2000) {
        lastHelloMs = millis();
        MsgHello h = { CMD_HELLO, NODE_ID };
        esp_err_t err = espnowSend(MASTER_MAC, (const uint8_t *)&h, sizeof(h));
        SLAVE_LOG_PRINTF("[SLAVE] HELLO tx err=%d txOK=%u txFail=%u\n",
                         (int)err, transport.sentOK(), transport.sentFail());
    }

    /* Informe de estado cada 10 s */
    static uint32_t last_status = 0;
    if (g_state != HOT_WAIT && millis() - last_status > 10000) {
        last_status = millis();
        MsgStatus st = {
            CMD_STATUS, NODE_ID,
            psoc.batchesOK(), psoc.batchesBad(),
            transport.sentOK(), transport.sentFail()
        };
        espnowSend(MASTER_MAC, (const uint8_t *)&st, sizeof(st));
        SLAVE_LOG_PRINTF("[SLAVE %d] bOK=%u bBad=%u txOK=%u txFail=%u state=%d\n",
                         NODE_ID,
                         psoc.batchesOK(), psoc.batchesBad(),
                         transport.sentOK(), transport.sentFail(),
                         (int)g_state);
    }
}
